src/Catalogs/Сложнопост/Сложнопост.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сложнопост</name>
  <attributes>
    <name>ПоследнееИспользование</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сообщество</name>
    <type>
      <types>CatalogRef.Сообщества</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>Медиа</name>
      <type>
        <types>CatalogRef.Файлы</types>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МедиаДД</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстА</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>900</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>900</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>900</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОбработки</name>
      <type>
        <types>CatalogRef.ВидыОбработкиИзображения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Сложнопост/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда	
		
		Элементы.Ресурсы.ТекущиеДанные.Медиа = ВыбранныеФайлы[0];
		ЗаписатьДвоичныеДанныеКартинки(Новый ДвоичныеДанные(Элементы.Ресурсы.ТекущиеДанные.Медиа), Элементы.Ресурсы.ТекущаяСтрока);	
		Закрыть();
	  	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ЭтотОбъект));

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвоичныеДанныеКартинки(ДД, ИД)
	
	Записать();
	ОбъектПост 												= Объект.Ссылка.ПолучитьОбъект();
	ОбъектПост.Ресурсы[ИД].МедиаДД 	= Новый ХранилищеЗначения(ДД);
	ОбъектПост.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(Элементы.Ресурсы.ТекущиеДанные.Медиа) = Тип("Строка") Тогда
		СтандартнаяОбработка 	= Ложь;
		Диалог 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок 		= "Выбирите файл";
		Диалог.Каталог			= "Z:\GDrive\Aioniotis\Images";
		ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
		Диалог.Показать(ОповещениеЗавершения);	
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
//Процедура РесурсыМедиаПриИзменении(Элемент)

//	Попытка
//	Если ТипЗнч(Элементы.Ресурсы.ТекущиеДанные.Медиа) = Тип("СправочникСсылка.Файлы") Тогда
//		
//		ЗаписатьДвоичныеДанныеФайла(Элементы.Ресурсы.ТекущиеДанные.Медиа, Элементы.Ресурсы.ТекущаяСтрока);
//		Закрыть();
//	  	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ЭтотОбъект));
//				
//	КонецЕсли;
//	Исключение КонецПопытки;
//	
//КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвоичныеДанныеФайла(Файл, ИД)
	
	ФайлОбъект = Файл.ПолучитьОбъект();
	ДД = ФайлОбъект.Файл.Получить();
	
	Записать();
	ОбъектПост 												= Объект.Ссылка.ПолучитьОбъект();
	ОбъектПост.Ресурсы[ИД].МедиаДД 	= Новый ХранилищеЗначения(ДД);
	ОбъектПост.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОтображениеКартинки(Команда)
	
	ТД = Элементы.Ресурсы.ТекущиеДанные;
	ОбновитьКартинкуСервер(ТД.ВидОбработки, СформироватьСтруктуруПоСтроке());
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуСервер(ВидОбработки, СтруктураОбработки)	
	ДД 			= МетодыОбработкиИзображений.ОбработатьКартинкуПоШаблону(ВидОбработки, СтруктураОбработки, Истина);
	Картинка 	= ПоместитьВоВременноеХранилище(ДД, Новый УникальныйИдентификатор);	
КонецПроцедуры

&НаКлиенте
Функция СформироватьСтруктуруПоСтроке()
	
	ТД = Элементы.Ресурсы.ТекущиеДанные;
	СтруктураРесурсов = Новый Структура;
	
	СтруктураРесурсов.Вставить("МедиаДД", ПолучитьМедиаДД(Элементы.Ресурсы.ТекущаяСтрока));
	СтруктураРесурсов.Вставить("Медиа"	, ТД.Медиа);	
	СтруктураРесурсов.Вставить("ТекстА"	, ТД.ТекстА);
	СтруктураРесурсов.Вставить("ТекстБ"	, ТД.ТекстБ);
	СтруктураРесурсов.Вставить("ТекстВ"	, ТД.ТекстВ);
	
	Возврат СтруктураРесурсов;
	
	
КонецФункции

&НаСервере
Функция ПолучитьМедиаДД(ИД)
	
	Записать();
	ОбъектПост 	= Объект.Ссылка.ПолучитьОбъект();
	Возврат ОбъектПост.Ресурсы[ИД].МедиаДД.Получить();
	
КонецФункции


&НаСервере
Процедура ЗапоститьНаСервере()
	Записать();
	ВК_Действия.ЗапоститьСложнопост(Объект.Ссылка, Объект.Сообщество);
	ТГ_Действия.ОтправитьСложнопост(Объект.Ссылка, Объект.Сообщество);
КонецПроцедуры


&НаКлиенте
Процедура Запостить(Команда)
	ЗапоститьНаСервере();
КонецПроцедуры
